[
  {
    "id": "2.47",
    "chapter": 2,
    "verse": 47,
    "topic": "Duty & Action",
    "devanagari": "कर्मण्येवाधिकारस्ते मा फलेषु कदाचन। मा कर्मफलहेतुर्भूर्मा ते सङ्गोऽस्त्वकर्मणि॥",
    "transliteration": "karmaṇy-evādhikāras te mā phaleṣhu kadāchana, mā karma-phala-hetur bhūr mā te saṅgo 'stvakarmaṇi",
    "meaning": "You have the right to perform your duty, but never to the fruits of action.",
    "explanation": "This famous verse teaches the essence of Karma Yoga: focus on your actions and efforts, not on outcomes. By releasing attachment to results, you free yourself from anxiety and can act with clarity and purpose.",
    "audioFileName": null
  },
  {
    "id": "2.56",
    "chapter": 2,
    "verse": 56,
    "topic": "Stress & Anxiety",
    "devanagari": "दुःखेष्वनुद्विग्नमनाः सुखेषु विगतस्पृहः। वीतरागभयक्रोधः स्थितधीर्मुनिरुच्यते॥",
    "transliteration": "duḥkheṣhv-anudvigna-manāḥ sukheṣhu vigata-spṛihaḥ, vīta-rāga-bhaya-krodhaḥ sthita-dhīr munir uchyate",
    "meaning": "One who is not disturbed by misery, who is free from desire for pleasure, and free from attachment, fear, and anger—such a person is called a sage of steady wisdom.",
    "explanation": "This verse describes emotional equanimity: remaining calm in difficulties and not chasing pleasures. When you cultivate this balance, stress loses its grip and you can navigate life's ups and downs with grace.",
    "audioFileName": null
  },
  {
    "id": "6.35",
    "chapter": 6,
    "verse": 35,
    "topic": "Discipline",
    "devanagari": "असंशयं महाबाहो मनो दुर्निग्रहं चलम्। अभ्यासेन तु कौन्तेय वैराग्येण च गृह्यते॥",
    "transliteration": "asanśhayaṁ mahā-bāho mano durnigrahaṁ chalam, abhyāsena tu kaunteya vairāgyeṇa cha gṛihyate",
    "meaning": "Undoubtedly, O mighty-armed one, the mind is restless and difficult to control. But it can be controlled through practice and detachment.",
    "explanation": "Krishna acknowledges that mastering the mind is challenging. However, through consistent practice (abhyāsa) and letting go of attachments (vairāgya), you can train your mind. This is the foundation of all discipline.",
    "audioFileName": null
  },
  {
    "id": "9.22",
    "chapter": 9,
    "verse": 22,
    "topic": "Devotion",
    "devanagari": "अनन्याश्चिन्तयन्तो मां ये जनाः पर्युपासते। तेषां नित्याभियुक्तानां योगक्षेमं वहाम्यहम्॥",
    "transliteration": "ananyāśh chintayanto māṁ ye janāḥ paryupāsate, teṣhāṁ nityābhiyuktānāṁ yoga-kṣhemaṁ vahāmyaham",
    "meaning": "To those who worship Me with devotion, meditating on Me with single-minded focus, I bring what they lack and preserve what they have.",
    "explanation": "When you dedicate yourself fully to the Divine with unwavering faith, you are supported in ways you cannot imagine. This verse offers deep reassurance—surrender brings protection and provision.",
    "audioFileName": null
  },
  {
    "id": "18.78",
    "chapter": 18,
    "verse": 78,
    "topic": "Wisdom",
    "devanagari": "यत्र योगेश्वरः कृष्णो यत्र पार्थो धनुर्धरः। तत्र श्रीर्विजयो भूतिर्ध्रुवा नीतिर्मतिर्मम॥",
    "transliteration": "yatra yogeśhvaraḥ kṛiṣhṇo yatra pārtho dhanur-dharaḥ, tatra śhrīr vijayo bhūtir dhruvā nītir matir mama",
    "meaning": "Wherever there is Krishna, the Lord of Yoga, and Arjuna, the wielder of the bow, there will always be prosperity, victory, happiness, and sound morality.",
    "explanation": "The Gita's final verse reminds us that when divine wisdom (Krishna) and sincere action (Arjuna) come together, success and righteousness follow naturally. Align yourself with truth and act with dedication.",
    "audioFileName": null
  },
  {
    "id": "3.35",
    "chapter": 3,
    "verse": 35,
    "topic": "Purpose",
    "devanagari": "श्रेयान्स्वधर्मो विगुणः परधर्मात्स्वनुष्ठितात्। स्वधर्मे निधनं श्रेयः परधर्मो भयावहः॥",
    "transliteration": "śhreyān swa-dharmo viguṇaḥ para-dharmāt sv-anuṣhṭhitāt, swa-dharme nidhanaṁ śhreyaḥ para-dharmo bhayāvahaḥ",
    "meaning": "It is better to perform one's own duty imperfectly than to perform another's duty perfectly. Even death in one's own duty is preferable; another's duty brings danger.",
    "explanation": "Follow your own path, even if imperfect, rather than imitating others. Your unique purpose (svadharma) is where you'll find fulfillment. Comparison and imitation lead to anxiety and disconnection from your true self.",
    "audioFileName": null
  },
  {
    "id": "2.14",
    "chapter": 2,
    "verse": 14,
    "topic": "Detachment",
    "devanagari": "मात्रास्पर्शास्तु कौन्तेय शीतोष्णसुखदुःखदाः। आगमापायिनोऽनित्यास्तांस्तितिक्षस्व भारत॥",
    "transliteration": "mātrā-sparśhās tu kaunteya śhītoṣhṇa-sukha-duḥkha-dāḥ, āgamāpāyino 'nityās tāṁs-titikṣhasva bhārata",
    "meaning": "O son of Kunti, the contact of the senses with objects gives rise to heat and cold, pleasure and pain. These are temporary—learn to tolerate them.",
    "explanation": "Sensations and emotions come and go like seasons. By recognizing their impermanent nature, you can observe them without being overwhelmed. This detachment brings inner stability.",
    "audioFileName": null
  },
  {
    "id": "4.18",
    "chapter": 4,
    "verse": 18,
    "topic": "Karma Yoga",
    "devanagari": "कर्मण्यकर्म यः पश्येदकर्मणि च कर्म यः। स बुद्धिमान्मनुष्येषु स युक्तः कृत्स्नकर्मकृत्॥",
    "transliteration": "karmaṇy-akarma yaḥ paśhyed akarmaṇi cha karma yaḥ, sa buddhimān manuṣhyeṣhu sa yuktaḥ kṛitsna-karma-kṛit",
    "meaning": "Those who see inaction in action, and action in inaction, are truly wise. They are yogis who have accomplished everything.",
    "explanation": "True wisdom lies in understanding that real action happens through non-attachment, while seemingly doing nothing can perpetuate karma. Act without ego and expectation—this is the secret of Karma Yoga.",
    "audioFileName": null
  },
  {
    "id": "2.38",
    "chapter": 2,
    "verse": 38,
    "topic": "Courage",
    "devanagari": "सुखदुःखे समे कृत्वा लाभालाभौ जयाजयौ। ततो युद्धाय युज्यस्व नैवं पापमवाप्स्यसि॥",
    "transliteration": "sukha-duḥkhe same kṛitvā lābhālābhau jayājayau, tato yuddhāya yujyasva naivaṁ pāpam avāpsyasi",
    "meaning": "Treating pleasure and pain, gain and loss, victory and defeat alike, engage in battle. Thus you will not incur sin.",
    "explanation": "Face life's challenges with courage and equanimity. When you act without fear of failure or greed for success, you remain free from negative consequences. This verse inspires fearless action.",
    "audioFileName": null
  },
  {
    "id": "5.21",
    "chapter": 5,
    "verse": 21,
    "topic": "Knowledge",
    "devanagari": "बाह्यस्पर्शेष्वसक्तात्मा विन्दत्यात्मनि यत्सुखम्। स ब्रह्मयोगयुक्तात्मा सुखमक्षयमश्नुते॥",
    "transliteration": "bāhya-sparśheṣhv-asakta-ātmā vindaty-ātmani yat sukham, sa brahma-yoga-yuktātmā sukham akṣhayam aśhnute",
    "meaning": "Those who are not attached to external sense pleasures realize the joy within. United with the Divine through meditation, they experience eternal bliss.",
    "explanation": "True happiness comes from within, not from external objects or experiences. By turning inward through self-knowledge and meditation, you discover an unshakeable source of joy that never fades.",
    "audioFileName": null
  },
  {
    "id": "6.5",
    "chapter": 6,
    "verse": 5,
    "topic": "Stress & Anxiety",
    "devanagari": "उद्धरेदात्मनात्मानं नात्मानमवसादयेत्। आत्मैव ह्यात्मनो बन्धुरात्मैव रिपुरात्मनः॥",
    "transliteration": "uddhared ātmanātmānaṁ nātmānam avasādayet, ātmaiva hyātmano bandhur ātmaiva ripur ātmanaḥ",
    "meaning": "Uplift yourself through your own efforts; do not degrade yourself. The mind is both the friend and enemy of the self.",
    "explanation": "You have the power to be your own greatest ally or worst enemy. By mastering your thoughts and emotions, you can lift yourself out of anxiety and negativity. Self-empowerment starts within.",
    "audioFileName": null
  },
  {
    "id": "12.13",
    "chapter": 12,
    "verse": 13,
    "topic": "Devotion",
    "devanagari": "अद्वेष्टा सर्वभूतानां मैत्रः करुण एव च। निर्ममो निरहङ्कारः समदुःखसुखः क्षमी॥",
    "transliteration": "adveṣhṭā sarva-bhūtānāṁ maitraḥ karuṇa eva cha, nirmamo nirahaṅkāraḥ sama-duḥkha-sukhaḥ kṣhamī",
    "meaning": "One who is free from malice toward all beings, friendly and compassionate, free from possessiveness and ego, balanced in joy and sorrow, and forgiving—such a person is dear to Me.",
    "explanation": "Divine love manifests through compassion, humility, and forgiveness. By cultivating these qualities, you naturally draw closer to the sacred and become a source of peace for others.",
    "audioFileName": null
  },
  {
    "id": "13.8",
    "chapter": 13,
    "verse": 8,
    "topic": "Wisdom",
    "devanagari": "अमानित्वमदम्भित्वमहिंसा क्षान्तिरार्जवम्। आचार्योपासनं शौचं स्थैर्यमात्मविनिग्रहः॥",
    "transliteration": "amānitvam adambhitvam ahiṁsā kṣhāntir ārjavam, āchāryopāsanaṁ śhauchaṁ sthairyam ātma-vinigrahaḥ",
    "meaning": "Humility, modesty, non-violence, forgiveness, straightforwardness, service to the teacher, purity, steadiness, and self-control—these are the qualities of wisdom.",
    "explanation": "True knowledge is inseparable from virtue. Wisdom isn't just intellectual—it's lived through humility, self-discipline, and treating all beings with kindness and respect.",
    "audioFileName": null
  },
  {
    "id": "16.1",
    "chapter": 16,
    "verse": 1,
    "topic": "Courage",
    "devanagari": "अभयं सत्त्वसंशुद्धिर्ज्ञानयोगव्यवस्थितिः। दानं दमश्च यज्ञश्च स्वाध्यायस्तप आर्जवम्॥",
    "transliteration": "abhayaṁ sattva-saṁśhuddhir jñāna-yoga-vyavasthitiḥ, dānaṁ damaśh cha yajñaśh cha svādhyāyas tapa ārjavam",
    "meaning": "Fearlessness, purity of heart, steadfastness in knowledge and yoga, charity, self-control, sacrifice, study of scriptures, austerity, and straightforwardness—these are divine qualities.",
    "explanation": "Fearlessness (abhaya) is the foundation of divine qualities. When you cultivate courage, purity, and discipline, you embody nobility and become a force for good in the world.",
    "audioFileName": null
  },
  {
    "id": "18.66",
    "chapter": 18,
    "verse": 66,
    "topic": "Devotion",
    "devanagari": "सर्वधर्मान्परित्यज्य मामेकं शरणं व्रज। अहं त्वां सर्वपापेभ्यो मोक्षयिष्यामि मा शुचः॥",
    "transliteration": "sarva-dharmān parityajya mām ekaṁ śharaṇaṁ vraja, ahaṁ tvāṁ sarva-pāpebhyo mokṣhayiṣhyāmi mā śhuchaḥ",
    "meaning": "Abandon all forms of dharma and simply surrender unto Me. I shall liberate you from all sins; do not grieve.",
    "explanation": "This is the Gita's ultimate teaching: complete surrender to the Divine. When you let go of ego and trust fully, you are freed from all burdens. Grace takes over where effort ends.",
    "audioFileName": null
  },
  {
    "id": "2.62",
    "chapter": 2,
    "verse": 62,
    "topic": "Mindfulness",
    "devanagari": "ध्यायतो विषयान्पुंसः सङ्गस्तेषूपजायते। सङ्गात्सञ्जायते कामः कामात्क्रोधोऽभिजायते॥",
    "transliteration": "dhyāyato viṣhayān puṁsaḥ saṅgas teṣhūpajāyate, saṅgāt sañjāyate kāmaḥ kāmāt krodho 'bhijāyate",
    "meaning": "Dwelling on sense objects creates attachment; attachment leads to desire; from desire arises anger.",
    "explanation": "This verse maps the chain of mental disturbance. By being mindful of where your attention goes, you can break the cycle of attachment, craving, and anger before it begins.",
    "audioFileName": null
  },
  {
    "id": "2.70",
    "chapter": 2,
    "verse": 70,
    "topic": "Peace",
    "devanagari": "आपूर्यमाणमचलप्रतिष्ठं समुद्रमापः प्रविशन्ति यद्वत्। तद्वत्कामा यं प्रविशन्ति सर्वे स शान्तिमाप्नोति न कामकामी॥",
    "transliteration": "āpūryamāṇam achala-pratiṣhṭhaṁ samudram āpaḥ praviśhanti yadvat, tadvat kāmā yaṁ praviśhanti sarve sa śhāntim āpnoti na kāma-kāmī",
    "meaning": "Just as the ocean remains unmoved even as rivers flow into it, one who remains unmoved by desires attains peace—not one who chases desires.",
    "explanation": "True peace comes from inner stability, not from satisfying endless wants. Like the ocean that absorbs rivers without overflowing, a wise person lets experiences come and go without losing composure.",
    "audioFileName": null
  },
  {
    "id": "4.7",
    "chapter": 4,
    "verse": 7,
    "topic": "Faith",
    "devanagari": "यदा यदा हि धर्मस्य ग्लानिर्भवति भारत। अभ्युत्थानमधर्मस्य तदात्मानं सृजाम्यहम्॥",
    "transliteration": "yadā yadā hi dharmasya glānir bhavati bhārata, abhyutthānam adharmasya tadātmānaṁ sṛijāmyaham",
    "meaning": "Whenever there is a decline in righteousness and rise of unrighteousness, O Arjuna, I manifest Myself.",
    "explanation": "This profound verse assures us that divine presence appears whenever needed. Have faith that goodness ultimately prevails—in times of darkness, light emerges to restore balance.",
    "audioFileName": null
  },
  {
    "id": "4.38",
    "chapter": 4,
    "verse": 38,
    "topic": "Knowledge",
    "devanagari": "न हि ज्ञानेन सदृशं पवित्रमिह विद्यते। तत्स्वयं योगसंसिद्धः कालेनात्मनि विन्दति॥",
    "transliteration": "na hi jñānena sadṛiśhaṁ pavitram iha vidyate, tat svayaṁ yoga-saṁsiddhaḥ kālenātmani vindati",
    "meaning": "Nothing in this world purifies like knowledge. In time, one who is perfected in yoga realizes this knowledge within.",
    "explanation": "Self-knowledge is the ultimate purifier. Through dedicated practice and patience, wisdom dawns naturally from within—revealing your true nature beyond all limitations.",
    "audioFileName": null
  },
  {
    "id": "5.10",
    "chapter": 5,
    "verse": 10,
    "topic": "Detachment",
    "devanagari": "ब्रह्मण्याधाय कर्माणि सङ्गं त्यक्त्वा करोति यः। लिप्यते न स पापेन पद्मपत्रमिवाम्भसा॥",
    "transliteration": "brahmaṇy ādhāya karmāṇi saṅgaṁ tyaktvā karoti yaḥ, lipyate na sa pāpena padma-patram ivāmbhasā",
    "meaning": "One who acts without attachment, offering all actions to the Divine, is untouched by sin—like a lotus leaf untouched by water.",
    "explanation": "The lotus symbolizes perfect detachment: it grows in muddy water yet remains pristine. When you act selflessly, dedicating results to a higher purpose, negativity cannot cling to you.",
    "audioFileName": null
  },
  {
    "id": "6.17",
    "chapter": 6,
    "verse": 17,
    "topic": "Discipline",
    "devanagari": "युक्ताहारविहारस्य युक्तचेष्टस्य कर्मसु। युक्तस्वप्नावबोधस्य योगो भवति दुःखहा॥",
    "transliteration": "yuktāhāra-vihārasya yukta-cheṣhṭasya karmasu, yukta-svapnāvabodhasya yogo bhavati duḥkha-hā",
    "meaning": "For one who is moderate in eating and recreation, balanced in work, and regulated in sleep and waking, yoga becomes the destroyer of sorrow.",
    "explanation": "Balance in daily habits is essential for inner peace. Neither excess nor deprivation—moderation in food, activity, and rest creates the foundation for a joyful, mindful life.",
    "audioFileName": null
  },
  {
    "id": "6.29",
    "chapter": 6,
    "verse": 29,
    "topic": "Compassion",
    "devanagari": "सर्वभूतस्थमात्मानं सर्वभूतानि चात्मनि। ईक्षते योगयुक्तात्मा सर्वत्र समदर्शनः॥",
    "transliteration": "sarva-bhūta-stham ātmānaṁ sarva-bhūtāni chātmani, īkṣhate yoga-yuktātmā sarvatra sama-darśhanaḥ",
    "meaning": "A true yogi sees the Self in all beings and all beings in the Self, seeing the same divine presence everywhere.",
    "explanation": "When you recognize the same consciousness in all living beings, compassion arises naturally. This universal vision dissolves separation and awakens unconditional love for all life.",
    "audioFileName": null
  },
  {
    "id": "9.26",
    "chapter": 9,
    "verse": 26,
    "topic": "Devotion",
    "devanagari": "पत्रं पुष्पं फलं तोयं यो मे भक्त्या प्रयच्छति। तदहं भक्त्युपहृतमश्नामि प्रयतात्मनः॥",
    "transliteration": "patraṁ puṣhpaṁ phalaṁ toyaṁ yo me bhaktyā prayachchhati, tad ahaṁ bhakty-upahṛitam aśhnāmi prayatātmanaḥ",
    "meaning": "If one offers Me with devotion a leaf, a flower, a fruit, or water, I accept that offering of love from a pure heart.",
    "explanation": "Devotion is not about grand gestures but the sincerity of your heart. Even the simplest offering made with love is received by the Divine. Your intention matters more than the form.",
    "audioFileName": null
  },
  {
    "id": "11.33",
    "chapter": 11,
    "verse": 33,
    "topic": "Purpose",
    "devanagari": "तस्मात्त्वमुत्तिष्ठ यशो लभस्व जित्वा शत्रून्भुङ्क्ष्व राज्यं समृद्धम्। मयैवैते निहताः पूर्वमेव निमित्तमात्रं भव सव्यसाचिन्॥",
    "transliteration": "tasmāt tvam uttiṣhṭha yaśho labhasva jitvā śhatrūn bhuṅkṣhva rājyaṁ samṛiddham, mayaivaite nihatāḥ pūrvam eva nimitta-mātraṁ bhava savyasāchin",
    "meaning": "Therefore arise and attain glory. Conquer your enemies and enjoy a prosperous kingdom. They have already been slain by Me; be an instrument of My will.",
    "explanation": "You are an instrument of a larger cosmic plan. When you align with your purpose and act courageously, you participate in something greater than yourself. Rise and fulfill your destiny.",
    "audioFileName": null
  },
  {
    "id": "15.15",
    "chapter": 15,
    "verse": 15,
    "topic": "Wisdom",
    "devanagari": "सर्वस्य चाहं हृदि संनिविष्टो मत्तः स्मृतिर्ज्ञानमपोहनं च। वेदैश्च सर्वैरहमेव वेद्यो वेदान्तकृद्वेदविदेव चाहम्॥",
    "transliteration": "sarvasya chāhaṁ hṛidi sanniviṣhṭo mattaḥ smṛitir jñānam apohanaṁ cha, vedaiśh cha sarvair aham eva vedyo vedānta-kṛid veda-vid eva chāham",
    "meaning": "I am seated in the hearts of all beings. From Me come memory, knowledge, and their removal. I am that which is to be known through all the Vedas; I am the author of the Vedanta and the knower of the Vedas.",
    "explanation": "The Divine dwells within you as your innermost awareness—the source of all knowing and forgetting. True wisdom is recognizing this sacred presence in your own heart.",
    "audioFileName": null
  }
]
